nxp-appcodehub/gs-motor-control-application-framework/board/pin_mux.h
#define INIT_PINS_LED_RED_SIGNAL PIO1                        /*!<@brief Signal name */
#define INIT_PINS_LED_RED_CHANNEL 28                         /*!<@brief Signal channel */
#define INIT_PINS_LED_RED_PIN_NAME PIO1_28                   /*!<@brief Routed pin name */
#define INIT_PINS_LED_RED_LABEL "J122[16]/P1_28"             /*!<@brief Label */
#define INIT_PINS_LED_RED_NAME "LED_RED"                     /*!<@brief Identifier */
#define INIT_PINS_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define INIT_PINS_LED_RED_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define INIT_PINS_LED_RED_GPIO_PIN 28U                       /*!<@brief GPIO pin number */
#define INIT_PINS_LED_RED_GPIO_PIN_MASK (1U << 28U)          /*!<@brief GPIO pin mask */
#define INIT_PINS_LED_RED_PORT 1                             /*!<@brief PORT peripheral base pointer */
#define INIT_PINS_LED_RED_PIN 28U                            /*!<@brief PORT pin number */
#define INIT_PINS_LED_RED_PIN_MASK (1U << 28U)               /*!<@brief PORT pin mask */
                                                             /* @} */
/*! @name PIO0_22 (number 78), J12[8]/JP72[2]/P0_22
  @{ */
/* Routed pin properties */
#define INIT_PINS_LED_GREEN_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define INIT_PINS_LED_GREEN_SIGNAL PIO0                        /*!<@brief Signal name */
#define INIT_PINS_LED_GREEN_CHANNEL 22                         /*!<@brief Signal channel */
#define INIT_PINS_LED_GREEN_PIN_NAME PIO0_22                   /*!<@brief Routed pin name */
#define INIT_PINS_LED_GREEN_LABEL "J12[8]/JP72[2]/P0_22"       /*!<@brief Label */
#define INIT_PINS_LED_GREEN_NAME "LED_GREEN"                   /*!<@brief Identifier */
#define INIT_PINS_LED_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define INIT_PINS_LED_GREEN_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define INIT_PINS_LED_GREEN_GPIO_PIN 22U                       /*!<@brief GPIO pin number */
#define INIT_PINS_LED_GREEN_GPIO_PIN_MASK (1U << 22U)          /*!<@brief GPIO pin mask */
#define INIT_PINS_LED_GREEN_PORT 0                             /*!<@brief PORT peripheral base pointer */
#define INIT_PINS_LED_GREEN_PIN 22U                            /*!<@brief PORT pin number */
#define INIT_PINS_LED_GREEN_PIN_MASK (1U << 22U)               /*!<@brief PORT pin mask */
                                                               /* @} */
/*! @name PIO0_17 (number 41), JP73[2]/J8[2]/P0_17
  @{ */
/* Routed pin properties */
#define INIT_PINS_SW3_PERIPHERAL PINT             /*!<@brief Peripheral name */
#define INIT_PINS_SW3_SIGNAL PINT                 /*!<@brief Signal name */
#define INIT_PINS_SW3_CHANNEL 0                   /*!<@brief Signal channel */
#define INIT_PINS_SW3_PIN_NAME PIO0_17            /*!<@brief Routed pin name */
#define INIT_PINS_SW3_LABEL "JP73[2]/J8[2]/P0_17" /*!<@brief Label */
#define INIT_PINS_SW3_NAME "SW3"                  /*!<@brief Identifier */
#define INIT_PINS_SW3_PORT 0                      /*!<@brief PORT peripheral base pointer */
#define INIT_PINS_SW3_PIN 17U                     /*!<@brief PORT pin number */
#define INIT_PINS_SW3_PIN_MASK (1U << 17U)        /*!<@brief PORT pin mask */
                                                  /* @} */
/*! @name ADC0_8A (number 23), P0_31-ADC0_8A
  @{ */
/* Routed pin properties */
#define INIT_PINS_ADC0_8A_PERIPHERAL ADC0           /*!<@brief Peripheral name */
#define INIT_PINS_ADC0_8A_SIGNAL CH                 /*!<@brief Signal name */
#define INIT_PINS_ADC0_8A_CHANNEL 8A                /*!<@brief Signal channel */
#define INIT_PINS_ADC0_8A_PIN_NAME ADC0_8A          /*!<@brief Routed pin name */
#define INIT_PINS_ADC0_8A_LABEL "P0_31-ADC0_8A"     /*!<@brief Label */
#define INIT_PINS_ADC0_8A_NAME "ADC0_8A"            /*!<@brief Identifier */
#define INIT_PINS_ADC0_8A_PORT 0                    /*!<@brief PORT peripheral base pointer */
#define INIT_PINS_ADC0_8A_PIN 31U                   /*!<@brief PORT pin number */
#define INIT_PINS_ADC0_8A_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                    /* @} */
/*! @name HSCMP0_IN3 (number 35), P1_5-HSCMP0_IN3
  @{ */
/* Routed pin properties */
#define INIT_PINS_HSCMP0_IN3_PERIPHERAL HSCMP0        /*!<@brief Peripheral name */
#define INIT_PINS_HSCMP0_IN3_SIGNAL IN                /*!<@brief Signal name */
#define INIT_PINS_HSCMP0_IN3_CHANNEL 3                /*!<@brief Signal channel */
#define INIT_PINS_HSCMP0_IN3_PIN_NAME HSCMP0_IN3      /*!<@brief Routed pin name */
#define INIT_PINS_HSCMP0_IN3_LABEL "P1_5-HSCMP0_IN3"  /*!<@brief Label */
#define INIT_PINS_HSCMP0_IN3_NAME "HSCMP0_IN3"        /*!<@brief Identifier */
#define INIT_PINS_HSCMP0_IN3_PORT 1                   /*!<@brief PORT peripheral base pointer */
#define INIT_PINS_HSCMP0_IN3_PIN 5U                   /*!<@brief PORT pin number */
#define INIT_PINS_HSCMP0_IN3_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */
/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Pins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
